app/controllers/motions_controller.rb

SELECT `motions`.* FROM `motions`
---
  def index

    @all_motion_data = Motion.all