app/controllers/toirets_controller.rb

  def index
   @toiret_data = Toiret.all
   @fifteenF = Toiret.where("toiret_floor = ?","15F").maximum(:datetime)
---
SELECT MAX(distance) FROM `toirets`
SELECT `toirets`.* FROM `toirets`
SELECT MAX(`toirets`.`datetime`) FROM `toirets` WHERE (toiret_floor = '15F')

  def situation
   @toiret_data = Toiret.all
   @fifteenF = Toiret.where("toiret_floor = ?","15F").maximum(:datetime)
---
SELECT "toirets".* FROM "toirets" WHERE "toirets"."toiret_floor" = ? AND "toirets"."datetime" IS NULL  [["toiret_floor", "15F"]]
SELECT MAX(`toirets`.`datetime`) FROM `toirets` WHERE (toiret_floor = '15F')